#include <stdio.h>
#include <math.h>

int main() {
    double x, f; // Змінна для зберігання введеного числа та результату функції

    printf("Введіть дійсне число x: ");
    if (scanf("%lf", &x)!= 1) {   // Перевірка на успішне введення числа
        printf("Неможливо обчислити значення виразу.\n");
        return 1; // Завершення програми з кодом помилки
    }
    //з використанням повної форми оператора розгалуження if ... else

    if (x > 0) { // Якщо x більше нуля
        f = x * x + 5 * x - 6;
    } else {    // Якщо x менше або дорівнює нулю
        f = fabs(x + cos(x)); // Використання fabs для обчислення абсолютного значення
    }

    printf("Значення функції f(x): %.2lf\n", f);

    return 0;
}
