#include <stdio.h>
#include <math.h>

int main() {
    double x1, y1, x2, y2, x3, y3; // Координати вершин першого трикутника
    double x4, y4, x5, y5, x6, y6; // Координати вершин другого трикутника
    double area1, area2; // змінні для зберігання площ трикутників

    // Введення координат першого трикутника
    printf("Трикутник 1 (x1 y1 x2 y2 x3 y3): ");
    scanf("%lf %lf %lf %lf %lf %lf", &x1, &y1, &x2, &y2, &x3, &y3);

    // Введення координат другого трикутника
    printf("Трикутник 2 (x4 y4 x5 y5 x6 y6): ");
    scanf("%lf %lf %lf %lf %lf %lf", &x4, &y4, &x5, &y5, &x6, &y6);

    // Формула площі трикутника
    area1 = fabs(x1*(y2 - y3) + x2*(y3 - y1) + x3*(y1 - y2)) / 2; // Площа першого трикутника

    area2 = fabs(x4*(y5 - y6) + x5*(y6 - y4) + x6*(y4 - y5)) / 2; // Площа другого трикутника

    // Перевірка існування трикутників
    if (area1 == 0 && area2 == 0) // Якщо обидва трикутники не існують
        printf("Обидва трикутники не існують.\n");
    else if (area1 == 0) //
        printf("Перший трикутник не існує.\n");
    else if (area2 == 0)
        printf("Другий трикутник не існує.\n");
    else {
        printf("Площа трикутника 1: %.2lf\n", area1);
        printf("Площа трикутника 2: %.2lf\n", area2);

        if (area1 > area2) // Порівняння площ трикутників
            printf("Перший трикутник більший.\n");
        else if (area2 > area1)
            printf("Другий трикутник більший.\n");
        else
            printf("Трикутники рівні за площею.\n");
    }

    return 0;
}
